
//------------------------------------------------.
//	シャドウマップ生成用シェーダー.
//------------------------------------------------.


//------------------------------------------------.
//	コンスタントバッファ.
//------------------------------------------------.
//メッシュ.
cbuffer per_frame : register(b0)
{
	matrix g_mLightWVP; //ワールド,ビュー,プロジェクションの合成行列.
};

//------------------------------------------------.
//	頂点シェーダーの出力.
//------------------------------------------------.
struct VS_OUTPUT
{
	float4 Pos : SV_POSITION; //ライト視点での位置
	float4 Depth : POSITION;	//ワールド空間での頂点位置
};


//------------------------------------------------.
//	頂点シェーダー
//------------------------------------------------.
VS_OUTPUT VS_Main(float4 Pos : POSITION)
{
	VS_OUTPUT output;
	
	//ワールド変換 → ライト空間での変換
	output.Pos = mul(Pos, g_mLightWVP);
	
	output.Depth = output.Pos;
	
	return output;
	
};


//------------------------------------------------.
//	ピクセルシェーダー 
//------------------------------------------------.
float4 PS_ShadowMap(VS_OUTPUT input) : SV_Target
{
	float4 color = input.Depth.z / input.Depth.w;
	
	//深度値の正規化と記録
	return color;
};